Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-MC_DFP/1.2.52/PIC32CM6408MC00032/include/pic32cm6408mc00032.h
/*
 * \brief CMSIS includes
 */
#include "core_cm0plus.h"
#if defined USE_CMSIS_INIT
#include "system_pic32cmmc00.h"
#endif /* USE_CMSIS_INIT */

/** \defgroup PIC32CM6408MC00032_api Peripheral Software API
 *  @{
 */

/* ************************************************************************** */
/**  SOFTWARE PERIPHERAL API DEFINITION FOR PIC32CM6408MC00032                */
/* ************************************************************************** */
#include "component/ac.h"
#include "component/adc.h"
#include "component/ccl.h"
#include "component/dac.h"
#include "component/divas.h"
#include "component/dmac.h"
#include "component/dsu.h"
#include "component/eic.h"
#include "component/evsys.h"
#include "component/freqm.h"
#include "component/gclk.h"
#include "component/hmatrixb.h"
#include "component/mclk.h"
#include "component/mtb.h"
#include "component/nvmctrl.h"
#include "component/osc32kctrl.h"
#include "component/oscctrl.h"
#include "component/pac.h"
#include "component/pdec.h"
#include "component/pm.h"
#include "component/port.h"
#include "component/rstc.h"
#include "component/rtc.h"
#include "component/sdadc.h"
#include "component/sercom.h"
#include "component/supc.h"
#include "component/tc.h"
#include "component/tcc.h"
#include "component/tsens.h"
#include "component/wdt.h"
/** @}  end of Peripheral Software API */

/* ************************************************************************** */
/*   INSTANCE DEFINITIONS FOR PIC32CM6408MC00032 */
/* ************************************************************************** */
#include "instance/ac.h"
#include "instance/adc0.h"
#include "instance/adc1.h"
#include "instance/ccl.h"
#include "instance/dac.h"
#include "instance/divas.h"
#include "instance/dmac.h"
#include "instance/dsu.h"
#include "instance/eic.h"
#include "instance/evsys.h"
#include "instance/freqm.h"
#include "instance/gclk.h"
#include "instance/hmatrixhs.h"
#include "instance/mclk.h"
#include "instance/mtb.h"
#include "instance/nvmctrl.h"
#include "instance/osc32kctrl.h"
#include "instance/oscctrl.h"
#include "instance/pac.h"
#include "instance/pdec.h"
#include "instance/pm.h"
#include "instance/port.h"
#include "instance/rstc.h"
#include "instance/rtc.h"
#include "instance/sdadc.h"
#include "instance/sercom0.h"
#include "instance/sercom1.h"
#include "instance/sercom2.h"
#include "instance/sercom3.h"
#include "instance/supc.h"
#include "instance/tc0.h"
#include "instance/tc1.h"
#include "instance/tc2.h"
#include "instance/tc3.h"
#include "instance/tc4.h"
#include "instance/tcc0.h"
#include "instance/tcc1.h"
#include "instance/tcc2.h"
#include "instance/tsens.h"
#include "instance/wdt.h"

/** \addtogroup PIC32CM6408MC00032_id Peripheral Ids Definitions
 *  @{
 */

/* ************************************************************************** */
/*  PERIPHERAL ID DEFINITIONS FOR PIC32CM6408MC00032                          */
/* ************************************************************************** */
#define ID_PAC           (  0) /**< \brief Instance index for PAC (PAC) */
#define ID_PM            (  1) /**< \brief Instance index for PM (PM) */
#define ID_MCLK          (  2) /**< \brief Instance index for MCLK (MCLK) */
#define ID_RSTC          (  3) /**< \brief Instance index for RSTC (RSTC) */
#define ID_OSCCTRL       (  4) /**< \brief Instance index for OSCCTRL (OSCCTRL) */
#define ID_OSC32KCTRL    (  5) /**< \brief Instance index for OSC32KCTRL (OSC32KCTRL) */
#define ID_SUPC          (  6) /**< \brief Instance index for SUPC (SUPC) */
#define ID_GCLK          (  7) /**< \brief Instance index for GCLK (GCLK) */
#define ID_WDT           (  8) /**< \brief Instance index for WDT (WDT) */
#define ID_RTC           (  9) /**< \brief Instance index for RTC (RTC) */
#define ID_EIC           ( 10) /**< \brief Instance index for EIC (EIC) */
#define ID_FREQM         ( 11) /**< \brief Instance index for FREQM (FREQM) */
#define ID_TSENS         ( 12) /**< \brief Instance index for TSENS (TSENS) */
#define ID_PORT          ( 32) /**< \brief Instance index for PORT (PORT) */
#define ID_DSU           ( 33) /**< \brief Instance index for DSU (DSU) */
#define ID_NVMCTRL       ( 34) /**< \brief Instance index for NVMCTRL (NVMCTRL) */
#define ID_DMAC          ( 35) /**< \brief Instance index for DMAC (DMAC) */
#define ID_MTB           ( 36) /**< \brief Instance index for MTB (MTB) */
#define ID_HMATRIXHS     ( 37) /**< \brief Instance index for HMATRIXHS (HMATRIXHS) */
#define ID_EVSYS         ( 64) /**< \brief Instance index for EVSYS (EVSYS) */
#define ID_SERCOM0       ( 65) /**< \brief Instance index for SERCOM0 (SERCOM0) */
#define ID_SERCOM1       ( 66) /**< \brief Instance index for SERCOM1 (SERCOM1) */
#define ID_SERCOM2       ( 67) /**< \brief Instance index for SERCOM2 (SERCOM2) */
#define ID_SERCOM3       ( 68) /**< \brief Instance index for SERCOM3 (SERCOM3) */
#define ID_TCC0          ( 73) /**< \brief Instance index for TCC0 (TCC0) */
#define ID_TCC1          ( 74) /**< \brief Instance index for TCC1 (TCC1) */
#define ID_TCC2          ( 75) /**< \brief Instance index for TCC2 (TCC2) */
#define ID_TC0           ( 76) /**< \brief Instance index for TC0 (TC0) */
#define ID_TC1           ( 77) /**< \brief Instance index for TC1 (TC1) */
#define ID_TC2           ( 78) /**< \brief Instance index for TC2 (TC2) */
#define ID_TC3           ( 79) /**< \brief Instance index for TC3 (TC3) */
#define ID_TC4           ( 80) /**< \brief Instance index for TC4 (TC4) */
#define ID_ADC0          ( 81) /**< \brief Instance index for ADC0 (ADC0) */
#define ID_ADC1          ( 82) /**< \brief Instance index for ADC1 (ADC1) */
#define ID_SDADC         ( 83) /**< \brief Instance index for SDADC (SDADC) */
#define ID_AC            ( 84) /**< \brief Instance index for AC (AC) */
#define ID_DAC           ( 85) /**< \brief Instance index for DAC (DAC) */
#define ID_CCL           ( 87) /**< \brief Instance index for CCL (CCL) */
#define ID_PDEC          ( 90) /**< \brief Instance index for PDEC (PDEC) */

