Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-MC_DFP/1.2.52/PIC32CM6408MC00032/include/pic32cm6408mc00032.h
#define ID_PERIPH_MAX    ( 90) /**< \brief Number of peripheral IDs */
/** @}  end of Peripheral Ids Definitions */

/** \addtogroup PIC32CM6408MC00032_base Peripheral Base Address Definitions
 *  @{
 */

/* ************************************************************************** */
/*   REGISTER STRUCTURE ADDRESS DEFINITIONS FOR PIC32CM6408MC00032            */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#define AC_REGS                          ((ac_registers_t*)0x42005000)                 /**< \brief AC Registers Address         */
#define ADC0_REGS                        ((adc_registers_t*)0x42004400)                /**< \brief ADC0 Registers Address       */
#define ADC1_REGS                        ((adc_registers_t*)0x42004800)                /**< \brief ADC1 Registers Address       */
#define CCL_REGS                         ((ccl_registers_t*)0x42005c00)                /**< \brief CCL Registers Address        */
#define DAC_REGS                         ((dac_registers_t*)0x42005400)                /**< \brief DAC Registers Address        */
#define DIVAS_REGS                       ((divas_registers_t*)0x48000000)              /**< \brief DIVAS Registers Address      */
#define DMAC_REGS                        ((dmac_registers_t*)0x41006000)               /**< \brief DMAC Registers Address       */
#define DSU_REGS                         ((dsu_registers_t*)0x41002000)                /**< \brief DSU Registers Address        */
#define EIC_REGS                         ((eic_registers_t*)0x40002800)                /**< \brief EIC Registers Address        */
#define EVSYS_REGS                       ((evsys_registers_t*)0x42000000)              /**< \brief EVSYS Registers Address      */
#define FREQM_REGS                       ((freqm_registers_t*)0x40002c00)              /**< \brief FREQM Registers Address      */
#define GCLK_REGS                        ((gclk_registers_t*)0x40001c00)               /**< \brief GCLK Registers Address       */
#define HMATRIXHS_REGS                   ((hmatrixb_registers_t*)0x4100a000)           /**< \brief HMATRIXHS Registers Address  */
#define MCLK_REGS                        ((mclk_registers_t*)0x40000800)               /**< \brief MCLK Registers Address       */
#define MTB_REGS                         ((mtb_registers_t*)0x41008000)                /**< \brief MTB Registers Address        */
#define NVMCTRL_REGS                     ((nvmctrl_registers_t*)0x41004000)            /**< \brief NVMCTRL Registers Address    */
#define OSCCTRL_REGS                     ((oscctrl_registers_t*)0x40001000)            /**< \brief OSCCTRL Registers Address    */
#define OSC32KCTRL_REGS                  ((osc32kctrl_registers_t*)0x40001400)         /**< \brief OSC32KCTRL Registers Address */
#define PAC_REGS                         ((pac_registers_t*)0x40000000)                /**< \brief PAC Registers Address        */
#define PDEC_REGS                        ((pdec_registers_t*)0x42006800)               /**< \brief PDEC Registers Address       */
#define PM_REGS                          ((pm_registers_t*)0x40000400)                 /**< \brief PM Registers Address         */
#define PORT_REGS                        ((port_registers_t*)0x41000000)               /**< \brief PORT Registers Address       */
#define PORT_IOBUS_REGS                  ((port_registers_t*)0x60000000)               /**< \brief PORT Registers Address       */
#define RSTC_REGS                        ((rstc_registers_t*)0x40000c00)               /**< \brief RSTC Registers Address       */
#define RTC_REGS                         ((rtc_registers_t*)0x40002400)                /**< \brief RTC Registers Address        */
#define SDADC_REGS                       ((sdadc_registers_t*)0x42004c00)              /**< \brief SDADC Registers Address      */
#define SERCOM0_REGS                     ((sercom_registers_t*)0x42000400)             /**< \brief SERCOM0 Registers Address    */
#define SERCOM1_REGS                     ((sercom_registers_t*)0x42000800)             /**< \brief SERCOM1 Registers Address    */
#define SERCOM2_REGS                     ((sercom_registers_t*)0x42000c00)             /**< \brief SERCOM2 Registers Address    */
#define SERCOM3_REGS                     ((sercom_registers_t*)0x42001000)             /**< \brief SERCOM3 Registers Address    */
#define SUPC_REGS                        ((supc_registers_t*)0x40001800)               /**< \brief SUPC Registers Address       */
#define TC0_REGS                         ((tc_registers_t*)0x42003000)                 /**< \brief TC0 Registers Address        */
#define TC1_REGS                         ((tc_registers_t*)0x42003400)                 /**< \brief TC1 Registers Address        */
#define TC2_REGS                         ((tc_registers_t*)0x42003800)                 /**< \brief TC2 Registers Address        */
#define TC3_REGS                         ((tc_registers_t*)0x42003c00)                 /**< \brief TC3 Registers Address        */
#define TC4_REGS                         ((tc_registers_t*)0x42004000)                 /**< \brief TC4 Registers Address        */
#define TCC0_REGS                        ((tcc_registers_t*)0x42002400)                /**< \brief TCC0 Registers Address       */
#define TCC1_REGS                        ((tcc_registers_t*)0x42002800)                /**< \brief TCC1 Registers Address       */
#define TCC2_REGS                        ((tcc_registers_t*)0x42002c00)                /**< \brief TCC2 Registers Address       */
#define TSENS_REGS                       ((tsens_registers_t*)0x40003000)              /**< \brief TSENS Registers Address      */
#define WDT_REGS                         ((wdt_registers_t*)0x40002000)                /**< \brief WDT Registers Address        */
#endif /* (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
/** @}  end of Peripheral Base Address Definitions */

/** \addtogroup PIC32CM6408MC00032_base Peripheral Base Address Definitions
 *  @{
 */

/* ************************************************************************** */
/*   BASE ADDRESS DEFINITIONS FOR PIC32CM6408MC00032                          */
/* ************************************************************************** */
#define AC_BASE_ADDRESS                  _UL_(0x42005000)                              /* AC Base Address */
#define ADC0_BASE_ADDRESS                _UL_(0x42004400)                              /* ADC0 Base Address */
#define ADC1_BASE_ADDRESS                _UL_(0x42004800)                              /* ADC1 Base Address */
#define CCL_BASE_ADDRESS                 _UL_(0x42005c00)                              /* CCL Base Address */
#define DAC_BASE_ADDRESS                 _UL_(0x42005400)                              /* DAC Base Address */
#define DIVAS_BASE_ADDRESS               _UL_(0x48000000)                              /* DIVAS Base Address */
#define DMAC_BASE_ADDRESS                _UL_(0x41006000)                              /* DMAC Base Address */
#define DSU_BASE_ADDRESS                 _UL_(0x41002000)                              /* DSU Base Address */
#define EIC_BASE_ADDRESS                 _UL_(0x40002800)                              /* EIC Base Address */
#define EVSYS_BASE_ADDRESS               _UL_(0x42000000)                              /* EVSYS Base Address */
#define FREQM_BASE_ADDRESS               _UL_(0x40002c00)                              /* FREQM Base Address */
#define GCLK_BASE_ADDRESS                _UL_(0x40001c00)                              /* GCLK Base Address */
#define HMATRIXHS_BASE_ADDRESS           _UL_(0x4100a000)                              /* HMATRIXHS Base Address */
#define MCLK_BASE_ADDRESS                _UL_(0x40000800)                              /* MCLK Base Address */
#define MTB_BASE_ADDRESS                 _UL_(0x41008000)                              /* MTB Base Address */
#define NVMCTRL_BASE_ADDRESS             _UL_(0x41004000)                              /* NVMCTRL Base Address */
#define OSCCTRL_BASE_ADDRESS             _UL_(0x40001000)                              /* OSCCTRL Base Address */
#define OSC32KCTRL_BASE_ADDRESS          _UL_(0x40001400)                              /* OSC32KCTRL Base Address */
#define PAC_BASE_ADDRESS                 _UL_(0x40000000)                              /* PAC Base Address */
#define PDEC_BASE_ADDRESS                _UL_(0x42006800)                              /* PDEC Base Address */
#define PM_BASE_ADDRESS                  _UL_(0x40000400)                              /* PM Base Address */
#define PORT_BASE_ADDRESS                _UL_(0x41000000)                              /* PORT Base Address */
#define PORT_IOBUS_BASE_ADDRESS          _UL_(0x60000000)                              /* PORT Base Address */
#define RSTC_BASE_ADDRESS                _UL_(0x40000c00)                              /* RSTC Base Address */
#define RTC_BASE_ADDRESS                 _UL_(0x40002400)                              /* RTC Base Address */
#define SDADC_BASE_ADDRESS               _UL_(0x42004c00)                              /* SDADC Base Address */
#define SERCOM0_BASE_ADDRESS             _UL_(0x42000400)                              /* SERCOM0 Base Address */
#define SERCOM1_BASE_ADDRESS             _UL_(0x42000800)                              /* SERCOM1 Base Address */
#define SERCOM2_BASE_ADDRESS             _UL_(0x42000c00)                              /* SERCOM2 Base Address */
#define SERCOM3_BASE_ADDRESS             _UL_(0x42001000)                              /* SERCOM3 Base Address */
#define SUPC_BASE_ADDRESS                _UL_(0x40001800)                              /* SUPC Base Address */
#define TC0_BASE_ADDRESS                 _UL_(0x42003000)                              /* TC0 Base Address */
#define TC1_BASE_ADDRESS                 _UL_(0x42003400)                              /* TC1 Base Address */
#define TC2_BASE_ADDRESS                 _UL_(0x42003800)                              /* TC2 Base Address */
#define TC3_BASE_ADDRESS                 _UL_(0x42003c00)                              /* TC3 Base Address */
#define TC4_BASE_ADDRESS                 _UL_(0x42004000)                              /* TC4 Base Address */
#define TCC0_BASE_ADDRESS                _UL_(0x42002400)                              /* TCC0 Base Address */
#define TCC1_BASE_ADDRESS                _UL_(0x42002800)                              /* TCC1 Base Address */
#define TCC2_BASE_ADDRESS                _UL_(0x42002c00)                              /* TCC2 Base Address */
#define TSENS_BASE_ADDRESS               _UL_(0x40003000)                              /* TSENS Base Address */
#define WDT_BASE_ADDRESS                 _UL_(0x40002000)                              /* WDT Base Address */
/** @}  end of Peripheral Base Address Definitions */

/** \addtogroup PIC32CM6408MC00032_pio Peripheral Pio Definitions
 *  @{
 */

/* ************************************************************************** */
/*   PIO DEFINITIONS FOR PIC32CM6408MC00032                                   */
/* ************************************************************************** */
#include "pio/pic32cm6408mc00032.h"
/** @}  end of Peripheral Pio Definitions */

/* ************************************************************************** */
/*   MEMORY MAPPING DEFINITIONS FOR PIC32CM6408MC00032                        */
/* ************************************************************************** */

